tutorials/SandiaPropaneJet/0.org/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    jet
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
    }
    bluffBody
    {
        type            slip;
    }
    coflow
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
    }
    outflow
    {
        type            zeroGradient;
    }
    axis
    {
        type            slip;
    }
    outerWall
    {
        type            slip;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
