tutorials/SandiaPropaneJet/0.org/rho
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.2008167034416974;

boundaryField
{
    jet
    {
        type            fixedValue;
        value           uniform 1.827818074845729;
    }
    bluffBody
    {
        type            zeroGradient;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 1.2008167034416974;
    }
    outflow
    {
        type            zeroGradient;
    }
    axis
    {
        type            slip;
    }
    outerWall
    {
        type            zeroGradient;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
