tutorials/SandiaPropaneJet/constant/polyMesh/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1; // meters

vertices
(
    (0    0.1494292e-3 -0.01307336e-3)  //  0
    (0.3  0.1494292e-3 -0.01307336e-3)  //  1
    (0.3  0.00259753 -0.00011341)  //  2
    (0       0.00259753 -0.00011341)  //  3
    (0.3  0.00449572 -0.000196287)  //  4
    (0       0.00449572 -0.000196287)  //  5
    (0.3  0.0399619 -0.00174478)  //  6
    (0       0.0399619 -0.00174478)  //  7

    (0    0.1494292e-3 0.01307336e-3)  //  8
    (0.3  0.1494292e-3 0.01307336e-3)  //  9
    (0.3  0.00259753  0.00011341)  //  10
    (0       0.00259753  0.00011341)  //  11
    (0.3  0.00449572  0.000196287)  // 12
    (0       0.00449572  0.000196287)  // 13
    (0.3  0.0399619  0.00174478)  // 14
    (0       0.0399619  0.00174478)  // 15
);

blocks
(
    hex (0  1  2  3  8  9 10 11) (54 7 1) simpleGrading (6 1.1 1)
    hex (3  2  4  5 11 10 12 13) (54 5 1) simpleGrading (6 1.2 1)
    hex (5  4  6  7 13 12 14 15) (54 24 1) simpleGrading (6 6 1)
);

patches
(
    patch jet
    (
        (0 8 11 3)
    )
    patch bluffBody
    (
        (3 11 13 5)
    )
    patch coflow
    (
        (5 13 15 7)
    )
    patch outflow
    (
        (1 2 10  9)
        (2 4 12 10)
        (4 6 14 12)
    )
    patch axis
    (
        (8 0 1 9)
    )
    patch outerWall
    (
        (7 15 14 6)
    )
    wedge back
    (
        (0 3 2 1)
        (3 5 4 2)
        (5 7 6 4)
    )
    wedge front
    (
        ( 8  9  10 11)
        (11  10 12 13)
        (13 12 14 15)
    )
);

// *********************** vim: set ft=cpp et sw=4 : *********************** //
