tutorials/SandiaPropaneJet/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-05;
D               D  [ 0 2 -1 0 0 0 0 ] 1e-05;

// *********************** vim: set ft=cpp et sw=4 : *********************** //
